Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_tx_test_console/firmware/src/packs/PIC32CX2051MTG128_DFP/component/dwdt.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DWDT register API structure */
typedef struct
{
  __O   uint32_t                       DWDT_WDT1_CR;       /**< Offset: 0x00 ( /W  32) Watchdog 1 Control Register */
  __IO  uint32_t                       DWDT_WDT1_MR;       /**< Offset: 0x04 (R/W  32) Watchdog 1 Mode Register */
  __I   uint32_t                       DWDT_WDT1_VR;       /**< Offset: 0x08 (R/   32) Watchdog 1 Value Register */
  __IO  uint32_t                       DWDT_WDT1_WL;       /**< Offset: 0x0C (R/W  32) Watchdog 1 Window Level Register */
  __IO  uint32_t                       DWDT_WDT1_IL;       /**< Offset: 0x10 (R/W  32) Watchdog 1 Interrupt Level Register */
  __O   uint32_t                       DWDT_WDT1_IER;      /**< Offset: 0x14 ( /W  32) Watchdog 1 Interrupt Enable Register */
  __O   uint32_t                       DWDT_WDT1_IDR;      /**< Offset: 0x18 ( /W  32) Watchdog 1 Interrupt Disable Register */
  __I   uint32_t                       DWDT_WDT1_ISR;      /**< Offset: 0x1C (R/   32) Watchdog 1 Interrupt Status Register */
  __I   uint32_t                       DWDT_WDT1_IMR;      /**< Offset: 0x20 (R/   32) Watchdog 1 Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x11EC];
  __O   uint32_t                       DWDT_WDT0_CR;       /**< Offset: 0x1210 ( /W  32) Watchdog 0 Control Register */
  __IO  uint32_t                       DWDT_WDT0_MR;       /**< Offset: 0x1214 (R/W  32) Watchdog 0 Mode Register */
  __I   uint32_t                       DWDT_WDT0_VR;       /**< Offset: 0x1218 (R/   32) Watchdog 0 Value Register */
  __IO  uint32_t                       DWDT_WDT0_WL;       /**< Offset: 0x121C (R/W  32) Watchdog 0 Window Level */
  __IO  uint32_t                       DWDT_WDT0_IL;       /**< Offset: 0x1220 (R/W  32) Watchdog 0 Interrupt Level */
  __O   uint32_t                       DWDT_WDT0_IER;      /**< Offset: 0x1224 ( /W  32) Watchdog 0 Interrupt Enable Register */
  __O   uint32_t                       DWDT_WDT0_IDR;      /**< Offset: 0x1228 ( /W  32) Watchdog 0 Interrupt Disable Register */
  __I   uint32_t                       DWDT_WDT0_ISR;      /**< Offset: 0x122C (R/   32) Watchdog 0 Interrupt Status Register */
  __I   uint32_t                       DWDT_WDT0_IMR;      /**< Offset: 0x1230 (R/   32) Watchdog 0 Interrupt Mask Register */
  __IO  uint32_t                       DWDT_WDT1_LVLLIM;   /**< Offset: 0x1234 (R/W  32) Watchdog 1 Level Limits Register */
  __IO  uint32_t                       DWDT_WDT1_RLIM;     /**< Offset: 0x1238 (R/W  32) Watchdog 1 Repeat Limits Register */
  __IO  uint32_t                       DWDT_WDT1_PLIM;     /**< Offset: 0x123C (R/W  32) Watchdog 1 Period Limits Register */
} dwdt_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTG_DWDT_COMPONENT_H_ */
